import pyfiglet

#Способ №1
def banner1(text):

    a = []
    i = 0
    
    with open('Words.txt') as file:
        lines1 = file.read()
        lines2 = lines1.split('@@')
    lines2.pop()

    for line in lines2:
        a.append(line.split('@\n'))
        if (a[i][0][:1] == "\n"):
            a[i][0] = a[i][0].replace('\n', '')
        i += 1

    for j in range(6):
        temp = ''
        for i in range(len(text)):
            Ind = ord(text[i])
            if (65<= Ind <=90):
                temp += a[Ind - 65][j]
            elif (97 <= Ind <= 122):
                temp += a[Ind - 71][j]
        print(temp)

print('=========================Способ№1==================================')
banner1('Motosport')

#Способ №2
def banner2(string):
    print(pyfiglet.figlet_format(string))

print('=========================Способ№2==================================')
banner2('Silence')

'''
Вывод консоли:
=========================Способ№1==================================
  __  __           _                                          _   
 |  \/  |   ___   | |_    ___    ___   _ __     ___    _ __  | |_ 
 | |\/| |  / _ \  | __|  / _ \  / __| | '_ \   / _ \  | '__| | __|
 | |  | | | (_) | | |_  | (_) | \__ \ | |_) | | (_) | | |    | |_ 
 |_|  |_|  \___/   \__|  \___/  |___/ | .__/   \___/  |_|     \__|
                                      |_|                         
=========================Способ№2==================================
 ____  _ _                     
/ ___|(_) | ___ _ __   ___ ___ 
\___ \| | |/ _ \ '_ \ / __/ _ \
 ___) | | |  __/ | | | (_|  __/
|____/|_|_|\___|_| |_|\___\___|                        
'''


